
#include <stdio.h>
void menu() {
    printf("***************************************\n");
    printf("*****    欢迎使用学生成绩管理系统   ******\n");
    printf("*****    1:录入学生成绩           ******\n");
    printf("*****    2:显示学生成绩           ******\n");
    printf("*****    3:查询学生成绩           ******\n");
    printf("*****    4:修改学生成绩           ******\n");
    printf("*****    5:删除学生成绩           ******\n");
    printf("*****    6:排序学生成绩           ******\n");
    printf("*****    0:退出系统               ******\n");
    printf("***************************************\n");
}